; domain
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;


(define (domain thoughtful-typed)
	(:requirements :typing)
	(:types card colnum num suittype)
	(:predicates (on ?c1 - card ?c2 - card)
		(ace ?c - card)
		(king ?c - card)
		(clear ?c - card)
		(colspace ?n - colnum)
  		(bottomtalon ?c - card)
		(toptalon ?c - card)
		(ontalon ?c1 - card ?c2 - card)
		(talonplayable ?c - card)
		(instack ?c - card)
		(home ?c - card)
		(faceup ?c - card)
		(bottomcol ?c - card)
		(suit ?c - card ?s - suittype)
		(value ?c - card ?v - num)
		(successor ?n1 - num ?n0 - num)
		(canstack ?c1 - card ?c2 - card)
		(colsuccessor ?n1 - colnum ?n0 - colnum)
)

;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;;; Move card between columns.  
;;;;;;;;;;;;;;;;;;;;;;;;;;;;

;; move card from one column to another

	(:action move-col-to-col
		:parameters (?card ?oldcard ?newcard - card)
		:precondition (and 
			(faceup ?card)
			(clear ?newcard)
			(canstack ?card ?newcard)
			(on ?card ?oldcard))
		:effect(and
			(on ?card ?newcard)
			(clear ?oldcard)
			(faceup ?oldcard)
			(not (on ?card ?oldcard))
			(not (clear ?newcard))))

;; move card from one column to another - create an empty column

	(:action move-col-to-col-b
		:parameters (?card ?newcard - card ?cols ?ncols - colnum)
		:precondition (and 
				(faceup ?card)
				(bottomcol ?card)
				(clear ?newcard)
				(canstack ?card ?newcard)
				(colspace ?cols)
				(colsuccessor ?ncols ?cols))
		:effect (and 
			(on ?card ?newcard)
			(colspace ?ncols)
			(not (bottomcol ?card))
			(not (clear ?newcard))
			(not (colspace ?cols))))

;; send a king to an empty column

	(:action move-col-to-col-c
		:parameters (?card ?oldcard - card ?cols ?ncols - colnum)
		:precondition (and
			(faceup ?card)
			(king ?card)
			(colspace ?cols)
			(colsuccessor ?cols ?ncols)
			(on ?card ?oldcard))
		:effect (and
			(bottomcol ?card)
			(clear ?oldcard)
			(faceup ?oldcard)
			(colspace ?ncols)
			(not (on ?card ?oldcard))
			(not (colspace ?cols))))

;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;;; Move card from column to home 
;;;;;;;;;;;;;;;;;;;;;;;;;;;;

	(:action col-to-home
		:parameters (?card ?oldcard - card ?suit - suittype ?vcard - num
				?homecard - card ?vhomecard - num)
		:precondition (and
			(clear ?card)
			(on ?card ?oldcard)
			(home ?homecard)
			(suit ?card ?suit)
			(suit ?homecard ?suit)
			(value ?card ?vcard)
			(value ?homecard ?vhomecard)
			(successor ?vcard ?vhomecard))
		:effect (and
			(home ?card)
			(clear ?oldcard)
			(faceup ?oldcard)
			(on ?card ?homecard)
			(not (on ?card ?oldcard))
			(not (home ?homecard))
			(not (faceup ?card))
			(not (clear ?card))))

;; Move card from column to home - create an empty column

	(:action col-to-home-b
		:parameters (?card ?homecard - card ?suit - suittype ?vcard - num 
			?vhomecard - num ?cols ?ncols - colnum)
		:precondition (and
			(clear ?card)
			(bottomcol ?card)
			(home ?homecard)
			(suit ?card ?suit)
			(suit ?homecard ?suit)
			(value ?card ?vcard)
			(value ?homecard ?vhomecard)
			(successor ?vcard ?vhomecard)
			(colspace ?cols)
			(colsuccessor ?ncols ?cols))
		:effect (and
			(home ?card)
			(colspace ?ncols)
			(not (home ?homecard))
			(not (faceup ?card))
			(not (clear ?card))
			(not (bottomcol ?card))
			(not (colspace ?cols))))


;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;;; Move card from talon to column 
;;;;;;;;;;;;;;;;;;;;;;;;;;;;

	(:action tal-to-col
		:parameters (?card ?oldcard ?newcard ?cardabove - card)
		:precondition (and
			(clear ?newcard)
			(ontalon ?card ?oldcard)
			(ontalon ?cardabove ?card)
			(talonplayable ?card)
			(canstack ?card ?newcard))
		:effect (and
			(clear ?card)
			(faceup ?card)
			(talonplayable ?oldcard)
			(on ?card ?newcard)
			(ontalon ?cardabove ?oldcard)
			(not (clear ?newcard))
			(not (talonplayable ?card))
			(not (ontalon ?card ?oldcard))
			(not (ontalon ?cardabove ?card))))

;; move card from talon to column - card is bottom card in talon

	(:action tal-to-col-b
		:parameters (?card ?newcard ?cardabove - card)
		:precondition (and
			(clear ?newcard)
			(ontalon ?cardabove ?card)
			(talonplayable ?card)
			(bottomtalon ?card)
			(canstack ?card ?newcard))
		:effect (and
			(clear ?card)
			(faceup ?card)
			(on ?card ?newcard)
			(bottomtalon ?cardabove)
			(talonplayable ?cardabove)
			(not (bottomtalon ?card))
			(not (talonplayable ?card))
			(not (clear ?newcard))
			(not (ontalon ?cardabove ?card))))

;; move card from talon to column - card is top card in talon

	(:action tal-to-col-c
		:parameters (?card ?newcard ?oldcard - card)
		:precondition (and
			(clear ?newcard)
			(ontalon ?card ?oldcard)
			(canstack ?card ?newcard)
			(talonplayable ?card)
			(toptalon ?card))
		:effect (and
			(clear ?card)
			(faceup ?card)
			(on ?card ?newcard)
			(toptalon ?oldcard)
			(talonplayable ?oldcard)
			(not (clear ?newcard))
			(not (toptalon ?card))
			(not (talonplayable ?card))
			(not (ontalon ?card ?oldcard))))

;; move card from talon to column - card is the only card in talon

	(:action tal-to-col-d
		:parameters (?card ?newcard - card)
		:precondition (and
			(clear ?newcard)
			(canstack ?card ?newcard)
			(bottomtalon ?card)
			(toptalon ?card)
			(talonplayable ?card))
		:effect (and
			(clear ?card)
			(faceup ?card)
			(on ?card ?newcard)
			(not (clear ?newcard))
			(not (toptalon ?card))
			(not (talonplayable ?card))
			(not (bottomtalon ?card))))

;; move king from talon to column

	(:action tal-to-col-e
		:parameters (?card ?oldcard ?cardabove - card ?cols ?ncols - colnum)
		:precondition (and
			(king ?card)
			(ontalon ?card ?oldcard)
			(ontalon ?cardabove ?card)
			(talonplayable ?card)
			(colspace ?cols)
			(colsuccessor ?cols ?ncols))
		:effect (and
			(clear ?card)
			(faceup ?card)
			(talonplayable ?oldcard)
			(ontalon ?cardabove ?oldcard)
			(bottomcol ?card)
			(colspace ?ncols)
			(not (colspace ?cols))
			(not (talonplayable ?card))
			(not (ontalon ?card ?oldcard))
			(not (ontalon ?cardabove ?card))))

;; move king from talon to column - king is bottom card in talon

	(:action tal-to-col-f
		:parameters (?card ?cardabove - card ?cols ?ncols - colnum)
		:precondition (and
			(king ?card)
			(ontalon ?cardabove ?card)
			(talonplayable ?card)
			(bottomtalon ?card)
			(colspace ?cols)
			(colsuccessor ?cols ?ncols))
		:effect (and
			(clear ?card)
			(faceup ?card)
			(bottomtalon ?cardabove)
			(talonplayable ?cardabove)
			(bottomcol ?card)
			(colspace ?ncols)
			(not (colspace ?cols))
			(not (bottomtalon ?card))
			(not (talonplayable ?card))
			(not (ontalon ?cardabove ?card))))

;; move king from talon to column - card is top card in talon

	(:action tal-to-col-g
		:parameters (?card ?oldcard - card ?cols ?ncols - colnum)
		:precondition (and
			(king ?card)
			(ontalon ?card ?oldcard)
			(talonplayable ?card)
			(colspace ?cols)
			(colsuccessor ?cols ?ncols)
			(toptalon ?card))
		:effect (and
			(clear ?card)
			(faceup ?card)
			(toptalon ?oldcard)
			(talonplayable ?oldcard)
			(bottomcol ?card)
			(colspace ?ncols)
			(not (colspace ?cols))
			(not (toptalon ?card))
			(not (talonplayable ?card))
			(not (ontalon ?card ?oldcard))))

;; move king from talon to column - card is the only card in talon

	(:action tal-to-col-h
		:parameters (?card - card ?cols ?ncols - colnum)
		:precondition (and
			(king ?card)
			(bottomtalon ?card)
			(toptalon ?card)
			(colspace ?cols)
			(colsuccessor ?cols ?ncols)
			(talonplayable ?card))
		:effect (and
			(clear ?card)
			(faceup ?card)
			(bottomcol ?card)
			(colspace ?ncols)
			(not (colspace ?cols))
			(not (toptalon ?card))
			(not (talonplayable ?card))
			(not (bottomtalon ?card))))

;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;;; Move card from talon to home 
;;;;;;;;;;;;;;;;;;;;;;;;;;;;

;; move card from talon to home

	(:action tal-to-home
		:parameters (?card ?cardabove ?cardbelow ?homecard - card ?cardsuit - suittype
			?vcard ?vhomecard - num)
		:precondition (and
			(talonplayable ?card)
			(ontalon ?cardabove ?card)
			(ontalon ?card ?cardbelow)
			(suit ?card ?cardsuit)
			(suit ?homecard ?cardsuit)
			(home ?homecard)
			(value ?card ?vcard)
			(value ?homecard ?vhomecard)
			(successor ?vcard ?vhomecard))
		:effect (and
			(talonplayable ?cardbelow)
			(not (talonplayable ?card))
			(ontalon ?cardabove ?cardbelow)
			(not (ontalon ?cardabove ?card))
			(not (ontalon ?card ?cardbelow))
			(home ?card)
			(not (home ?homecard))))

;; move card from talon to home - card is bottom card in talon

	(:action tal-to-home-b
		:parameters (?card ?cardabove ?homecard  - card ?cardsuit - suittype
			?vcard ?vhomecard - num)
		:precondition (and
			(talonplayable ?card)
			(ontalon ?cardabove ?card)
			(bottomtalon ?card)
			(home ?homecard)
			(suit ?card ?cardsuit)
			(suit ?homecard ?cardsuit)
			(value ?card ?vcard)
			(value ?homecard ?vhomecard)
			(successor ?vcard ?vhomecard))
		:effect (and
			(bottomtalon ?cardabove)
			(talonplayable ?cardabove)
			(home ?card)
			(not (bottomtalon ?card))
			(not (talonplayable ?card))
			(not (ontalon ?cardabove ?card))
			(not (home ?homecard))))

;; move card from talon to home - card is top card in talon

	(:action tal-to-home-c
		:parameters (?card ?cardbelow ?homecard - card ?cardsuit - suittype
			?vcard ?vhomecard - num)
		:precondition (and
			(ontalon ?card ?cardbelow)
			(talonplayable ?card)
			(toptalon ?card)
			(home ?homecard)
			(suit ?card ?cardsuit)
			(suit ?homecard ?cardsuit)
			(value ?card ?vcard)
			(value ?homecard ?vhomecard)
			(successor ?vcard ?vhomecard))
		:effect (and
			(toptalon ?cardbelow)
			(talonplayable ?cardbelow)
			(home ?card)
			(not (home ?homecard))
			(not (toptalon ?card))
			(not (talonplayable ?card))
			(not (ontalon ?card ?cardbelow))))

;; move card from talon to home - card is the only card in talon

	(:action tal-to-home-d
		:parameters (?card ?homecard - card ?cardsuit - suittype
			?vcard ?vhomecard - num)
		:precondition (and
			(bottomtalon ?card)
			(toptalon ?card)
			(talonplayable ?card)
			(home ?homecard)
			(suit ?card ?cardsuit)
			(suit ?homecard ?cardsuit)
			(value ?card ?vcard)
			(value ?homecard ?vhomecard)
			(successor ?vcard ?vhomecard))
		:effect (and
			(home ?card)
			(not (home ?homecard))
			(not (toptalon ?card))
			(not (talonplayable ?card))
			(not (bottomtalon ?card))))


;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;;; Move card from home to column (pointless to move aces from home)
;;;;;;;;;;;;;;;;;;;;;;;;;;;;

;; move card from home to column
	
	(:action home-to-col
		:parameters (?card ?cardbelow ?newcard - card ?cardsuit - suittype
			?vcard ?vcardbelow - num)
		:precondition (and
			(home ?card)
			(suit ?card ?cardsuit)
			(suit ?cardbelow ?cardsuit)
			(value ?card ?vcard)
			(value ?cardbelow ?vcardbelow)
			(successor ?vcard ?vcardbelow)
			(canstack ?card ?newcard)
			(clear ?newcard))
		:effect (and
			(clear ?card)
			(faceup ?card)
			(home ?cardbelow)
			(on ?card ?newcard)
			(not (home ?card))
			(not (clear ?newcard))))

;; move king from home to column
	
	(:action home-to-col-a
		:parameters (?card ?cardbelow - card ?cardsuit - suittype
			?vcard ?vcardbelow - num ?cols ?ncols - colnum)
		:precondition (and
			(home ?card)
			(king ?card)
			(suit ?card ?cardsuit)
			(suit ?cardbelow ?cardsuit)
			(value ?card ?vcard)
			(value ?cardbelow ?vcardbelow)
			(successor ?vcard ?vcardbelow)
			(colspace ?cols)
			(colsuccessor ?cols ?ncols))
		:effect (and
			(home ?cardbelow)
			(bottomcol ?card)
			(clear ?card)
			(faceup ?card)
			(colspace ?ncols)
			(not (colspace ?cols))
			(not (home ?card))))

;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;;; Turn Deck
;;;;;;;;;;;;;;;;;;;;;;;;;;;;
			
;; turn deck

	(:action turn-deck
		:parameters (?card ?c1 - card)
		:precondition (and
			(talonplayable ?card)
			(ontalon ?c1 ?card))
		:effect (and
			(talonplayable ?c1)
			(not (talonplayable ?card))))

;; turn deck - top talon card is currently talon playable	- at least 4 cards in talon

	(:action turn-deck-a
		:parameters (?card ?c1 - card)
		:precondition (and
			(talonplayable ?card)
			(toptalon ?card)
			(bottomtalon ?c1))
		:effect (and
			(talonplayable ?c1)
			(not (talonplayable ?card)))))
			
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

; problem
(define (problem thoughtful-s5-t4)
(:domain thoughtful-typed)
(:objects
    DUMMY1 DUMMY2 DUMMY3 DUMMY4
    C0 CA C2 C3 C4 C5 
    D0 DA D2 D3 D4 D5 
    H0 HA H2 H3 H4 H5 
    S0 SA S2 S3 S4 S5 
 - card
    COLN0 COLN1 COLN2 COLN3 COLN4
 - colnum
    N0 N1 N2 N3 N4 N5
 - num
    C D H S
 - suittype
)
(:init
(VALUE C0 N0)
(VALUE D0 N0)
(VALUE H0 N0)
(VALUE S0 N0)
(VALUE CA N1)
(VALUE DA N1)
(VALUE HA N1)
(VALUE SA N1)
(VALUE C2 N2)
(VALUE D2 N2)
(VALUE H2 N2)
(VALUE S2 N2)
(VALUE C3 N3)
(VALUE D3 N3)
(VALUE H3 N3)
(VALUE S3 N3)
(VALUE C4 N4)
(VALUE D4 N4)
(VALUE H4 N4)
(VALUE S4 N4)
(VALUE C5 N5)
(VALUE D5 N5)
(VALUE H5 N5)
(VALUE S5 N5)
(COLSUCCESSOR COLN1 COLN0)
(COLSUCCESSOR COLN2 COLN1)
(COLSUCCESSOR COLN3 COLN2)
(COLSUCCESSOR COLN4 COLN3)
(SUCCESSOR N1 N0)
(SUCCESSOR N2 N1)
(SUCCESSOR N3 N2)
(SUCCESSOR N4 N3)
(SUCCESSOR N5 N4)
(SUIT C0 C)
(SUIT D0 D)
(SUIT H0 H)
(SUIT S0 S)
(SUIT CA C)
(SUIT DA D)
(SUIT HA H)
(SUIT SA S)
(SUIT C2 C)
(SUIT D2 D)
(SUIT H2 H)
(SUIT S2 S)
(SUIT C3 C)
(SUIT D3 D)
(SUIT H3 H)
(SUIT S3 S)
(SUIT C4 C)
(SUIT D4 D)
(SUIT H4 H)
(SUIT S4 S)
(SUIT C5 C)
(SUIT D5 D)
(SUIT H5 H)
(SUIT S5 S)
(KING C5)
(KING D5)
(KING H5)
(KING S5)
(CANSTACK C2 D3)
(CANSTACK C2 H3)
(CANSTACK S2 D3)
(CANSTACK S2 H3)
(CANSTACK D2 C3)
(CANSTACK D2 S3)
(CANSTACK H2 C3)
(CANSTACK H2 S3)
(CANSTACK C3 D4)
(CANSTACK C3 H4)
(CANSTACK S3 D4)
(CANSTACK S3 H4)
(CANSTACK D3 C4)
(CANSTACK D3 S4)
(CANSTACK H3 C4)
(CANSTACK H3 S4)
(CANSTACK C4 D5)
(CANSTACK C4 H5)
(CANSTACK S4 D5)
(CANSTACK S4 H5)
(CANSTACK D4 C5)
(CANSTACK D4 S5)
(CANSTACK H4 C5)
(CANSTACK H4 S5)
(COLSPACE COLN0)
(BOTTOMCOL D4)
(CLEAR D4)
(FACEUP D4)
(BOTTOMCOL S3)
(ON C4 S3)
(CLEAR C4)
(FACEUP C4)
(BOTTOMCOL H2)
(ON D5 H2)
(ON DA D5)
(CLEAR DA)
(FACEUP DA)
(BOTTOMCOL H3)
(ON H4 H3)
(ON CA H4)
(ON C5 CA)
(CLEAR C5)
(FACEUP C5)
(BOTTOMTALON D3)
(ONTALON C2 D3)
(ONTALON SA C2)
(ONTALON S2 SA)
(ONTALON C3 S2)
(ONTALON H5 C3)
(ONTALON S4 H5)
(ONTALON HA S4)
(ONTALON D2 HA)
(ONTALON S5 D2)
(TOPTALON S5)
(TALONPLAYABLE SA)
(HOME C0)
(HOME D0)
(HOME H0)
(HOME S0)
)
(:goal
(and
(HOME C5)
(HOME D5)
(HOME H5)
(HOME S5)
)
)
)

; plan
1. (move-col-to-col-b d4 c5 coln0 coln1)
   deleted: (bottomcol d4) (clear c5) (colspace coln0)
   added: (on d4 c5) (colspace coln1)
   goals met: 0 of 4
2. (move-col-to-col-c c5 ca coln1 coln0)
   deleted: (on c5 ca) (colspace coln1)
   added: (bottomcol c5) (clear ca) (faceup ca) (colspace coln0)
   goals met: 0 of 4
3. (col-to-home ca h4 c n1 c0 n0)
   deleted: (on ca h4) (home c0) (faceup ca) (clear ca)
   added: (home ca) (clear h4) (faceup h4) (on ca c0)
   goals met: 0 of 4
4. (tal-to-home sa s2 c2 s0 s n1 n0)
   deleted: (talonplayable sa) (ontalon s2 sa) (ontalon sa c2) (home s0)
   added: (talonplayable c2) (ontalon s2 c2) (home sa)
   goals met: 0 of 4
5. (tal-to-home c2 s2 d3 ca c n2 n1)
   deleted: (talonplayable c2) (ontalon s2 c2) (ontalon c2 d3) (home ca)
   added: (talonplayable d3) (ontalon s2 d3) (home c2)
   goals met: 0 of 4
6. (tal-to-col-b d3 c4 s2)
   deleted: (bottomtalon d3) (talonplayable d3) (clear c4) (ontalon s2 d3)
   added: (clear d3) (faceup d3) (on d3 c4) (bottomtalon s2) (talonplayable s2)
   goals met: 0 of 4
7. (tal-to-home-b s2 c3 sa s n2 n1)
   deleted: (bottomtalon s2) (talonplayable s2) (ontalon c3 s2) (home sa)
   added: (bottomtalon c3) (talonplayable c3) (home s2)
   goals met: 0 of 4
8. (col-to-home da d5 d n1 d0 n0)
   deleted: (on da d5) (home d0) (faceup da) (clear da)
   added: (home da) (clear d5) (faceup d5) (on da d0)
   goals met: 0 of 4
9. (tal-to-home-b c3 h5 c2 c n3 n2)
   deleted: (bottomtalon c3) (talonplayable c3) (ontalon h5 c3) (home c2)
   added: (bottomtalon h5) (talonplayable h5) (home c3)
   goals met: 0 of 4
10. (move-col-to-col c4 s3 d5)
   deleted: (on c4 s3) (clear d5)
   added: (on c4 d5) (clear s3) (faceup s3)
   goals met: 0 of 4
11. (col-to-home-b s3 s2 s n3 n2 coln0 coln1)
   deleted: (home s2) (faceup s3) (clear s3) (bottomcol s3) (colspace coln0)
   added: (home s3) (colspace coln1)
   goals met: 0 of 4
12. (tal-to-col-f h5 s4 coln1 coln0)
   deleted: (colspace coln1) (bottomtalon h5) (talonplayable h5) (ontalon s4 h5)
   added: (clear h5) (faceup h5) (bottomtalon s4) (talonplayable s4) (bottomcol h5) (colspace coln0)
   goals met: 0 of 4
13. (tal-to-home-b s4 ha s3 s n4 n3)
   deleted: (bottomtalon s4) (talonplayable s4) (ontalon ha s4) (home s3)
   added: (bottomtalon ha) (talonplayable ha) (home s4)
   goals met: 0 of 4
14. (turn-deck ha d2)
   deleted: (talonplayable ha)
   added: (talonplayable d2)
   goals met: 0 of 4
15. (turn-deck d2 s5)
   deleted: (talonplayable d2)
   added: (talonplayable s5)
   goals met: 0 of 4
16. (tal-to-home-c s5 d2 s4 s n5 n4)
   deleted: (home s4) (toptalon s5) (talonplayable s5) (ontalon s5 d2)
   added: (toptalon d2) (talonplayable d2) (home s5)
   goals met: 1 of 4
17. (tal-to-home-c d2 ha da d n2 n1)
   deleted: (home da) (toptalon d2) (talonplayable d2) (ontalon d2 ha)
   added: (toptalon ha) (talonplayable ha) (home d2)
   goals met: 1 of 4
18. (col-to-home d3 c4 d n3 d2 n2)
   deleted: (on d3 c4) (home d2) (faceup d3) (clear d3)
   added: (home d3) (clear c4) (on d3 d2)
   goals met: 1 of 4
19. (col-to-home c4 d5 c n4 c3 n3)
   deleted: (on c4 d5) (home c3) (faceup c4) (clear c4)
   added: (home c4) (clear d5) (on c4 c3)
   goals met: 1 of 4
20. (col-to-home d4 c5 d n4 d3 n3)
   deleted: (on d4 c5) (home d3) (faceup d4) (clear d4)
   added: (home d4) (clear c5) (on d4 d3)
   goals met: 1 of 4
21. (col-to-home d5 h2 d n5 d4 n4)
   deleted: (on d5 h2) (home d4) (faceup d5) (clear d5)
   added: (home d5) (clear h2) (faceup h2) (on d5 d4)
   goals met: 2 of 4
22. (tal-to-home-d ha h0 h n1 n0)
   deleted: (home h0) (toptalon ha) (talonplayable ha) (bottomtalon ha)
   added: (home ha)
   goals met: 2 of 4
23. (col-to-home-b h2 ha h n2 n1 coln0 coln1)
   deleted: (home ha) (faceup h2) (clear h2) (bottomcol h2) (colspace coln0)
   added: (home h2) (colspace coln1)
   goals met: 2 of 4
24. (move-col-to-col h4 h3 c5)
   deleted: (on h4 h3) (clear c5)
   added: (on h4 c5) (clear h3) (faceup h3)
   goals met: 2 of 4
25. (col-to-home-b h3 h2 h n3 n2 coln1 coln2)
   deleted: (home h2) (faceup h3) (clear h3) (bottomcol h3) (colspace coln1)
   added: (home h3) (colspace coln2)
   goals met: 2 of 4
26. (col-to-home h4 c5 h n4 h3 n3)
   deleted: (on h4 c5) (home h3) (faceup h4) (clear h4)
   added: (home h4) (clear c5) (on h4 h3)
   goals met: 2 of 4
27. (col-to-home-b c5 c4 c n5 n4 coln2 coln3)
   deleted: (home c4) (faceup c5) (clear c5) (bottomcol c5) (colspace coln2)
   added: (home c5) (colspace coln3)
   goals met: 3 of 4
28. (col-to-home-b h5 h4 h n5 n4 coln3 coln4)
   deleted: (home h4) (faceup h5) (clear h5) (bottomcol h5) (colspace coln3)
   added: (home h5) (colspace coln4)
   goals met: 4 of 4
